       01  teste-var1       pic     x(20).
       01  teste-var2       pic     x(20).
           copy copybooks\tst_var_lv1.cpy.
       01  teste-var3       pic     x(20).